Revit 2026 API

# FilteredElementIterator Class

---

An iterator to a set of elements filtered by the settings of a FilteredElementCollector.

SystemObject Autodesk.Revit.DBFilteredElementIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilteredElementIterator : IEnumerator<Element>
```
```vb
Public Class FilteredElementIterator
	Implements IEnumerator(Of Element)
```
```cpp
public ref class FilteredElementIterator : IEnumerator<Element^>
```
```fsharp
type FilteredElementIterator =
    class
        interface IEnumerator<Element>
    end
```

The FilteredElementIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FilteredElementIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | The current element found by the iterator. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next element passing the filter. |
|  | Reset | Resets the iterator to the beginning. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace